<!-- 本期章程 -->
<template>
  <div class="constitutios">
    <div :style="background" class="bgBackground">
      <div class="moban">
        <div class="content1">
          <h2>2022-2023第七期“国家大剧院青年作曲家计划”章程</h2>
          <div class="title">
            <h5>一、总则</h5>
            <p>
              本计划由国家大剧院主办，每期历时两年。第七期计划于2022年3月底正式启动，并于2023年12月底结束。
            </p>
            <p>本计划的参选人应符合以下条件：</p>
            <p>
              全球华人，且年龄为45周岁以下（1977年4月1日以后出生），正在进行作曲或相关专业学习、从事作曲或相关工作的自然人。
            </p>
            <p>
              本计划将邀请海内外知名作曲家、指挥家、演奏家、相关机构负责人、艺术/音乐总监等组成专家评审组，以审看作品乐谱、审听作品录音、现场演奏评审等形式，最终评选产生3名优胜者。
            </p>
            <p>专家评审组成员的具体名单将由国家大剧院根据计划进程另行公布。</p>
            <h5>二、参选作品要求</h5>
            <p>
              1. 作品应为
              <b
                >中国弓弦乐器（如二胡、中胡、高胡、板胡、京胡等）与管弦乐队协奏曲</b
              >。
            </p>
            <p>管弦乐队最大编制不超过如下标注：</p>
            <p>
              木管 2（可包括短笛）/
              2（可包括英国管）/2（可包括低音单簧管）/2（可包括低音巴松）；
            </p>
            <p>铜管2/2/2/1件；</p>
            <p>弦乐12/10/8/6/4件。</p>
            <p>-非必选非定量乐器：</p>
            <p>打击乐（常规乐器）0-3人；</p>
            <p>竖琴0-1人</p>
            <p>
              2.
              作品时长应为12-15分钟，其准确时间长度须清晰标注于总谱第1页左上方。
            </p>
            <p>
              3.
              作品须以干净清楚的总谱进行投稿，所提供乐谱电子版须为可直接打印的A3尺寸、PDF格式。全谱谱面除标明作品名称或作品简要介绍以外，不得出现作者姓名及任何个人信息，不得出现任何与谱中音乐无关的标记。 
            </p>
            <p>4. 作品的编制须详细标注在总谱的扉页上。</p>
            <p>
              5. 作品音频仅限MP3.格式,
              建议上传高还原度的作品音频，不限于MIDI、现场录音等形式。
            </p>
            <p>
              6. 作品必须为作者本人原创作品，改编作品不在本计划征稿范围之列。
            </p>
            <p>
              7.
              作品必须创作于2018年之后，并且尚未在任何作曲赛事中获奖，尚未在任何商业演出中发表或演出。作品如进行过非商业的公开性演出，需同时提交相关说明性材料，说明性材料包括但不限于节目册、演出录音、演出报道等。
            </p>
            <p>8. 每位参选者限投报一部作品。</p>
            <h5>三、作品评审</h5>
            <p>
              递交作品日期截止之后，国家大剧院将通过专家评审组，对所有参选作品进行评审、选优。评审将按如下步骤分阶段进行：
            </p>
            <p>
              1.
              预评：2023年1月，评审出不多于20部作品进入复评阶段。进入复评阶段后的作品原则上除记谱错误或特殊原因接受适度修改外（需事先向组委会提交详细的修改说明并获准），不再接受任何修改。
            </p>
            <p>2. 初评：2023年2月，评审出不多于10部作品进入展演。</p>
            <p>
              3.
              展演及复评：2023年4月至10月，国家大剧院邀请职业乐团，对通过初评的作品在国内分别进行公开的音乐会演奏，并在展演结束之后根据展演录音评审出不多于5部作品进入终评。展演乐团及展演作品排练时长综合演出乐团、指挥、主办方音乐会时长等因素确定。其中，弓弦乐器独奏者由作曲家自行选择，需为25岁以下的青年演奏家，独奏者演出费用将由国家大剧院根据统一标准支付。
            </p>
            <p>
              4.
              终评：2023年12月，举办终评音乐会暨颁奖典礼，国家大剧院邀请职业乐团公开演奏不多于5部作品，并选出不多于3部获奖作品。
            </p>
            <h5>四、后续安排</h5>
            <p>
              国家大剧院将对入围终评音乐会的5部作品进行录制，并出版发行《第七期国家大剧院青年作曲家计划终评作品》专辑CD。
            </p>
            <p>
              国家大剧院将与本期计划的前三名签署协议，提供一定经费用于其对本次参评获奖作品的修改提高及推广。
            </p>
            <p>
              终评音乐会演出乐团将在排练期间评选出“乐手喜爱作品奖”，该作品将获得在“国家大剧院管弦乐团2023-2024乐季”中再度演出一次的机会。
            </p>
            <h5>五、相关费用</h5>
            <p>
              参选者为参与本计划而产生的报名材料准备、总分谱电子版制作等相关费用，均由参选者自行承担。
            </p>
            <p>
              对于通过预评而进入后续各个评审阶段的作品，其总分谱印制、乐团排练、乐团演出等费用，均由国家大剧院负责承担。对于进入展演和终评的参选者，如需参选者来演出现场配合有关工作，则其当地住宿、城际交通等费用，均由国家大剧院参照北京市相关政策标准承担。
            </p>
            <h5>六、相关权利</h5>
            <p>
              1.
              参选者应当是参选作品的作者，并独立享有参选作品完整的著作权。如参选者在报名时已与任何出版社签署长期版权代理协议，则应在其提交的报名材料中明确注明相关情况，其作品发表时间不能早于本计划展演，必需保证本计划展演为该作品的首演。
            </p>
            <p>
              2.
              通过复评并获得作品展演资格的参选者，须同意将如下权利无偿授予国家大剧院：
            </p>
            <p>
              （a）对作品的乐谱、录音、录像及任何形式的音像制品进行商业性使用(仅限一次性用于本期终评作品出版发行)的权利；
            </p>
            <p>
              （b）自本期计划结束之日起，对参选作品拥有为期两年的无偿演出权；
            </p>
            <p>
              3.
              所有参选者按本《章程》约定之方式提交参选作品之后，即视为作者已经知晓并同意本《章程》所有约定及要求。
            </p>
            <p>
              4.
              参选者必须确保本人提交信息及作品的真实性，如有任何虚假、舞弊或违反本章程规则之行为，国家大剧院有权随时取消其参选资格。
            </p>
            <p>
              5.
              本《章程》及相关附属文件均以中文书就，并附有英文译文。如中文文本与英文译文之间出现任何不一致，应以中文文本之语义为准。
            </p>
            <p>
              6.
              专家评审组对参选作品所做评判均为最终决定，且专家评审组有权做出仅选择不足3部作品作为优胜作品的决定。国家大剧院保留对本计划有关的任何安排做出变更的权利，并会通过国家大剧院官方网站对有关变更予以及时发布。
            </p>
            <p>
              对本《章程》及本计划的任何相关安排所产生的任何疑义，国家大剧院保留最终的解释权。与本计划有关的任何未尽事宜，均应由国家大剧院进一步制定规则并进行解释。
            </p>
            <h5>七、报名方式及报名时间</h5>
            <p>1. 本期计划将采用线上报名方式。</p>
            <p>
              2. 线上报名系统开放时间：2022年10月7日9：00 时至 2022年12月20日
              18:00 时。
            </p>
            <p>
              3.
              登陆国家大剧院官网http://www.chncpa.org，进入第七期国家大剧院青年作曲家计划专题页面，点击“我要报名”，完成注册后根据页面要求完成线上报名，所有报名流程完成后会显示“提交成功”
            </p>
            <h5>八、信息查询</h5>
            <p>
              本计划组委会将不晚于2022年12月31日前完成对所有报名材料和参选作品的审核，通过材料审核的作品将直接进入预审阶段。如有异常信息，将与参选者本人联系沟通。
            </p>
            <div class="right">
              <p>国家大剧院青年作曲家计划组委会</p>
              <p>2022年3月</p>
            </div>
          </div>
        </div>
      </div>
    </div>

    <el-button v-if="this.flag" @click="loginOut" class="tuichu"
      >退出登录</el-button
    >
  </div>
</template>

<script>
//这里可以导入其他文件（比如：组件，工具js，第三方插件js，json文件，图片文件等等）
//例如：import 《组件名称》 from '《组件路径》';

export default {
  //import引入的组件需要注入到对象中才能使用
  components: {},
  data() {
    //这里存放数据
    return {
      flag: false,

      // 顶部导航背景图片配置
      background: {
        // 背景图片地址
        backgroundImage: "url(" + require("../assets/images/map-bg.png") + ")",
        // 背景图片是否重复
        backgroundRepeat: "no-repeat",
        // 背景图片大小
        backgroundSize: "cover",
        // 背景图片位置
        backgroundPosition: "0px 0px",
        backgroundAttachment: "fixed",
      },
    };
  },
  //监听属性 类似于data概念
  computed: {},
  //监控data中的数据变化
  watch: {},
  //方法集合
  methods: {
    async loginOut() {
      this.$confirm("确定注销并退出系统吗？", "提示", {
        confirmButtonText: "确定",
        cancelButtonText: "取消",
        type: "warning",
      })
        .then(() => {
          this.$store.dispatch("LogOut").then(() => {
            sessionStorage.removeItem("username");
            sessionStorage.removeItem("sessionObj");
            location.href = "/aboutUs";
          });
        })
        .catch(() => {});
    },
  },
  beforeCreate() {}, //生命周期 - 创建之前
  //生命周期 - 创建完成（可以访问当前this实例）
  created() {},
  beforeMount() {}, //生命周期 - 挂载之前
  //生命周期 - 挂载完成（可以访问DOM元素）
  mounted() {
    var username = sessionStorage.getItem("username");
    if (username == null) {
      this.flag = false;
    } else {
      this.flag = true;
    }
  },
  beforeUpdate() {}, //生命周期 - 更新之前
  updated() {}, //生命周期 - 更新之后
  beforeDestroy() {}, //生命周期 - 销毁之前
  destroyed() {}, //生命周期 - 销毁完成
  activated() {}, //如果页面有keep-alive缓存功能，这个函数会触发
};
</script>
<style lang="less">
.constitutios {
  width: 100%;
  height: 100%;
  display: flex;
  justify-content: center;
  align-content: center;
  .bgBackground {
    width: 100%;
    height: 440%;
    position: relative;
    text-align: center;
    .moban {
      width: 100%;
      height: 101%;
      position: absolute;
      top: 0;
      left: 0;
      background: rgba(0, 0, 0, 0.7);
      .content1 {
        width: 850px;
        height: 100%;
        position: absolute;
        top: 0;
        right: 0;
        bottom: 0;
        left: 0;
        margin: 0 auto;
        z-index: 10;
        h2 {
          font-size: 33px;
          font-weight: 400;
          color: #fff;
          font-family: "Roboto Slab";
          margin: 50px;
        }
        .title {
          margin-top:80px;
          h5 {
            text-align: left;
            color: #fff;
            margin: 35px 0px 5px 0px;
            font-size: 20px;
          }
          p {
            color: #fff;
            font-size: 17px;
            line-height: 33px;
            font-weight: 400;
            text-align: left;
            text-indent: 34px;
            margin: 0;
          }
          .right{
              p{
                  text-align: right;
              }
          }
        }
      }
    }
  }
}
</style>